{
  "format": "graph-model",
  "generatedBy": "2.17.0",
  "convertedBy": "TensorFlow.js Converter v4.20.0",
  "signature": { "outputs": { "Identity:0": { "name": "Identity:0" } } },
  "modelTopology": {
    "node": [
      {
        "name": "ConstantFolding/PartitionedCall/model_27/tf.math.divide_1/truediv_recip",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "1" }]
              }
            }
          }
        }
      },
      {
        "name": "27697",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          }
        }
      },
      {
        "name": "27689",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27691",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_39/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27699",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "2" }, { "size": "8400" }]
              }
            }
          }
        }
      },
      {
        "name": "27683",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27685",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_36/StridedSlice/strides",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.reshape_26/Reshape/shape",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.compat.v1.transpose_47/transpose/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.compat.v1.transpose_48/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27687",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "1" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.compat.v1.transpose_53/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.reshape_29/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27693",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "27695",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_38/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_42/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.math.multiply_505/Mul/y",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "8400" }]
              }
            }
          }
        }
      },
      {
        "name": "27621",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27633",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "27645",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27657",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27669",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27679",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27619",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27631",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "27643",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27655",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "27667",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "5" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27681",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "5" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_32/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.compat.v1.transpose_30/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.reshape_17/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27617",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27629",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "27641",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27653",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "27665",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27675",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "27615",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27627",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "27639",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27651",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27663",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "128" },
                  { "size": "5" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27677",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "5" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_35/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.compat.v1.transpose_35/transpose/perm",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.reshape_20/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27613",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "512" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27625",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27637",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27649",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27661",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27671",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27603",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27605",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_34/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27573",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27575",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_32/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27543",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27545",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_30/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.image.resize_3/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_29/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "27527",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27529",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "27531",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27533",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_31/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27535",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27537",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27539",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27541",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_30/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27547",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27549",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27551",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "27553",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27555",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27519",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27521",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_28/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.image.resize_2/resize/size",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_27/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "27503",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "768" },
                  { "size": "256" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27505",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27507",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27509",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_29/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27511",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27513",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27515",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27517",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_28/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27523",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "256" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27525",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_31/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "27557",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "256" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27559",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27561",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27563",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_33/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27565",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27567",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "27569",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "128" },
                  { "size": "128" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27571",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.concat_33/concat/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27577",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "256" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27579",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27581",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "27583",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "256" },
                  { "size": "256" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27585",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          }
        }
      },
      {
        "name": "27487",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27489",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_26/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27457",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27459",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_24/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27419",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27421",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_22/ones_like",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27381",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "27383",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_20/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27353",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27355",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27357",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        }
      },
      {
        "name": "27359",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "27361",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27363",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "27365",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27367",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27369",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27371",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/model_27/tf.strided_slice_21/ones_like",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": {
            "tensor": {
              "dtype": "DT_INT64",
              "tensorShape": { "dim": [{ "size": "4" }] }
            }
          }
        }
      },
      {
        "name": "27373",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "27375",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "27377",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "32" }
                ]
              }
